{
  "backend/main.mo": "Motoko backend implementing access control, user profiles, configurable API URL, and aircraft tracking data storage with admin/user permissions.",
  "feature_evidence.json": "Defines feature evidence metadata linking features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for key frontend files used in the radar UI and data handling system.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode tokens, and global radar-themed styling.",
  "frontend/index.html": "HTML entry point providing the root container and loading the React application script.",
  "frontend/src/App.tsx": "Main app component managing authentication, profile setup flow, and rendering the flight radar dashboard.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache resets.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog allowing new users to enter and save their name to create a profile.",
  "frontend/src/components/radar/AircraftDetailsPanel.tsx": "Details panel showing selected aircraft information including category, telemetry, and position with close controls.",
  "frontend/src/components/radar/CategoryFilters.tsx": "Provides toggle buttons to enable or disable commercial, military, and general aviation aircraft filters.",
  "frontend/src/components/radar/DataProviderSettingsDialog.tsx": "Dialog for viewing and updating the aircraft data API URL using backend queries.",
  "frontend/src/components/radar/MapPresetsControl.tsx": "Renders buttons to switch between predefined map view presets such as US and Schenectady-Albany.",
  "frontend/src/components/radar/RadarMap.tsx": "Custom map component that renders aircraft positions with panning, zooming, and preset-centered views.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAircraftTracks.ts": "Fetches aircraft data from the configured API URL and normalizes OpenSky response entries for display.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and stored identity restoration via context.",
  "frontend/src/hooks/useQueries.ts": "Defines backend query and mutation hooks for user profiles, API URL management, and aircraft track histories.",
  "frontend/src/index.css": "Defines Tailwind base layers and a radar-themed light/dark color system plus utility classes and Leaflet UI overrides.",
  "frontend/src/main.tsx": "Initializes the React app, setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/FlightRadarDashboard.tsx": "Implements the main radar dashboard with map display, category filters, presets, aircraft selection, and loading/error states.",
  "frontend/src/utils/aircraftCategory.ts": "Provides logic to derive aircraft categories from OpenSky category codes.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with radar-themed OKLCH color variables, component extensions, and plugins.",
  "project_state.json": "Describes project metadata, existing radar features, and image requirements for build planning."
}